namespace Dispractice.Models
{
    public static class RankData
    {
        public static readonly Rank[] Ranks = 
        {
            new Rank("рядовой", "ряд.", 0),
            new Rank("ефрейтор", "ефр.", 1),
            new Rank("младший сержант", "мл. с-т", 2),
            new Rank("сержант", "с-т", 3),
            new Rank("старший сержант", "ст. с-т", 4),
            new Rank("старшина", "с-на", 5),
            new Rank("прапорщик", "пр-к", 6),
            new Rank("старший прапорщик", "ст. пр-к", 7),
            new Rank("младший лейтенант", "мл. л-т", 8),
            new Rank("лейтенант", "л-т", 9),
            new Rank("старший лейтенант", "ст. л-т", 10),
            new Rank("капитан", "к-н", 11),
            new Rank("майор", "м-р", 12),
            new Rank("подполковник", "п/п-к", 13),
            new Rank("полковник", "п-к", 14),
            new Rank("генерал-майор", "г/м-р", 15),
            new Rank("генерал-лейтенант", "г/л-т", 16),
            new Rank("генерал-полковник", "г/п-к", 17),
            new Rank("генерал армии", "генерал армии", 18)
        };
        public static readonly Rank[] NavalRanks =
        {
            new Rank("матрос", "м-с", 0),
            new Rank("старший матрос", "ст. м-с", 1),
            new Rank("старшина 2 статьи", "с-на 2 ст.", 2),
            new Rank("старшина 1 статьи", "с-на 1 ст.", 3),
            new Rank("главный старшина", "гл. с-на", 4),
            new Rank("главный корабельный старшина", "гл. к. с-на", 5),
            new Rank("мичман", "м-н", 6),
            new Rank("старший мичман", "ст. м-н", 7),
            new Rank("младший лейтенант", "мл. л-т", 8),
            new Rank("лейтенант", "л-т", 9),
            new Rank("старший лейтенант", "ст. л-т", 10),
            new Rank("капитан-лейтенант", "к/л", 11),
            new Rank("капитан 3 ранга", "кап. 3 р.", 12),
            new Rank("капитан 2 ранга", "кап. 2 р.", 13),
            new Rank("капитан 1 ранга", "кап. 1 р.", 14),
            new Rank("контр-адмирал", "к-адм.", 15),
            new Rank("вице-адмирал", "в-адм.", 16),
            new Rank("адмирал", "адм.", 17),
            new Rank("адмирал флота", "адмирал флота", 18)
        };
    }
    public record Rank(string RankName, string ShortName, int SeniorityOrder);
}



  